# -*- coding: utf-8 -*-
# __author__ = 'Administrator'


def q_30():
    print(0.40/0.60)
    print(0.40/0.50)
    print("P(A|B)不等于P(A), 不独立")


def q_32():
    print("美国：",(87.4+193.1)/(87.4+193.1+228.5+148.0))
    print("非美国：",(228.5+148.0)/(87.4+193.1+228.5+148.0))
    print("小汽车", (87.4+228.5)/(87.4+193.1+228.5+148.0))
    print("轻型卡车", (193.1+148.0)/(87.4+193.1+228.5+148.0))
    print("小汽车|美国", 87.4/(87.4+193.1))
    print("轻型卡车|美国", 193.1/(87.4+193.1))
    print("小汽车|非美国", 228.5/(228.5+148.0))
    print("轻型卡车|非美国", 148.0/(228.5+148.0))
    print("美国|轻型卡车", 193.1/(193.1+148.0))


def q_34():
    print("P(捷蓝and准点)=P(捷蓝)*P(准点|捷蓝)", 0.3*0.768)
    print("P(联合and准点)=P(联合)*P(准点|联合)", 0.32*0.715)
    print("P(美国and准点)=P(美国)*P(准点|美国)", 0.38*0.822)

    print("准点 上面三个相加",0.3*0.768+0.32*0.715+0.38*0.822)

    print("美国最高0.38，所以美国")

    print("延误：P(捷蓝|延误)=P(捷蓝and延误)/P(延误)", (0.3-0.3*0.768)/(1-0.77156))
    print("同理：联合", (0.32-0.32*0.715)/(1-0.77156))
    print("同理：美国", (0.38-0.38*0.822)/(1-0.77156))


def main():
    # q_30()
    # q_32()
    q_34()
    pass



if __name__ == "__main__":
    main()